Repository: MartinZikmund/PlayingWithPhysics
Catalog: src/Topics/Physics.RotationalInclinedPlane/Strings/*/Resources.resw
Source language: en_us
Languages: cs_cz

# AppDescription
source: When rolling bodies along an inclined plane, we must take into account not only the angle of the inclined plane, but also the dimensions of the body and its shape (or mass distribution). The program allows the selection of basic parameters (height and length of the inclined plane, dimensions and shape of the body - sphere, cylinder, hollow cylinder) and animates the rotational movement of the body along the inclined plane. Lists the calculated values of the selected quantities in the table. Content authors: Vladimír Kafka, Pavel Vlček Programmers: Daniel Zikmund, Martin Zikmund Graphics: Petr Weinlich
cs_cz: Při rotačním pohybu těles po nakloněné rovině musíme vzít v úvahu nejen úhel nakloněné roviny, ale i rozměry tělesa a jeho tvar (resp. rozložení hmoty). Program umožní volbu základních parametrů (výška a délka nakloněné roviny, rozměry a tvar tělesa – koule, válec, dutý válec) a animuje rotační pohyb tělesa po nakloněné rovině. Do tabulky vypíše vypočtené hodnoty zvolených veličin. Autoři obsahu: Vladimír Kafka, Pavel Vlček Programátoři: Daniel Zikmund, Martin Zikmund Grafika: Petr Weinlich

# AppName
source: Playing with Physics: Rolling on Inclined Plane
cs_cz: Hrátky s fyzikou: Valivý pohyb těles po nakloněné rovině

# BodyType_FullCylinder
source: Full cylinder
cs_cz: Válec

# BodyType_HollowCylinder
source: Hollow cylinder
cs_cz: Dutý válec

# BodyType_Sphere
source: Sphere
cs_cz: Koule

# ChangesApplyToAll
source: Changes apply to all objects
cs_cz: Změny platí pro všechna tělesa

# Input_Angle
source: Angle
cs_cz: Úhel

# Input_Body
source: Object
cs_cz: Těleso

# Input_BodyType
source: Body type
cs_cz: Typ tělesa

# Input_Environment
source: Environment
cs_cz: Prostředí

# Input_General
source: General
cs_cz: Obecné

# Input_Gravity
source: Gravity
cs_cz: Tíhové zrychlení

# Input_InclinedPlane
source: Inclined plane
cs_cz: Nakloněná rovina

# Input_Length
source: Length
cs_cz: Délka

# Input_Mass
source: Mass
cs_cz: Hmotnost

# Input_Radius
source: Radius
cs_cz: Poloměr

# PlaneLengthValidationHundredMessage
source: Length of the inclined plane must be at most 100 times bigger than the radius of any of the objects. The following objects currently violate this rule: {0}.
cs_cz: Délka nakloněné roviny musí být nejvýše stokrát větší než poloměr každého z objektů. Nyní to neplatí pro: {0}.

# PlaneLengthValidationTenMessage
source: Length of the inclined plane must be at least 10 times bigger than the radius of any of the objects. The following objects currently violate this rule: {0}.
cs_cz: Délka nakloněné roviny musí být alespoň desetkrát větší než poloměr každého z objektů. Nyní to neplatí pro: {0}.

# PlaneLengthValidationTitle
source: Input error
cs_cz: Chyba ve vstupu

# ShortAppName
source: Rolling on Inclined Plane
cs_cz: Valivý pohyb těles po nakloněné rovině

# TooManyMotionsDescription
source: Can't render more than 5 motions at once. Plese remove one.
cs_cz: Není možné vykreslovat více než 5 pohybů najednou.

# TooManyMotionsTitle
source: Can't add another motion
cs_cz: Vytvoření pohybu se nezdařilo.
